[
  {
    "id": 1,
    "groupName": "Peak idols",
    "mainCharacter": "Yang Bingyi",
    "chineseNickname": "Shuishui",
    "age": 25.0,
    "birthdayZodiac": "07.26/Leo",
    "mbti": "ENFP",
    "bloodType": "AB",
    "specialty": "Dancing, Sports",
    "interests": "Watching anime, otaku dance, horror movies, Cosplay",
    "musicType": "JPOP/Electronic Pop",
    "dislikedFood": "None",
    "likedFood": "Sweet food",
    "fears": "None",
    "weaknesses": "Not good at getting into state quickly on stage",
    "introduction": "They were born under the attention of thousands, defining the standards of idols with absolute strength, and standing at the peak of vision with a kingly posture.",
    "biography": "An idol with senior vibes, she became a SNH48 4th generation member at 14 and has been in the industry for 11 years. She regards the theater as the foundation of her faith, having only taken one leave in 3087 performances. She has high requirements for her performance effects, and will specially hire teachers to learn vocal music and dance. Even with external engagements, she will not give up the opportunity to perform in the theater. At the same time, she is eager to receive praise and recognition, and treats both teammates and fans sincerely. Former teammates who left the group said she has paid a lot for friends in unseen places, and she takes handshake events, homemade bento for fans, and comment replies very seriously. Therefore, she was able to climb for 7 years in the general election and finally reach the top.",
    "roleName": "Icey",
    "headicon": "/image/data/role/Icey.png",
    "groupIcon": "/image/data/role/Peak-idols.png"
  },
  {
    "id": 2,
    "groupName": "Peak idols",
    "mainCharacter": "Song Xinran",
    "chineseNickname": "Ranran",
    "age": 28.0,
    "birthdayZodiac": "07.08/Cancer",
    "mbti": "INFP/ISFP",
    "bloodType": "O",
    "specialty": "Singing, Latin dance, Erhu",
    "interests": "Sports, traveling, watching movies",
    "musicType": "JPOP, R&B",
    "dislikedFood": "None",
    "likedFood": "Shrimp slides",
    "fears": "None",
    "weaknesses": "Not good at communicating with unfamiliar men",
    "introduction": null,
    "biography": "Her viral stage performances are sweet, charming and sexy, but she is delicate and sensitive in private. She not only has professional stage skills with Grade 8 vocal music, Grade 10 Erhu, and international gold medal in Latin dance, but also performed brilliantly in archery at sports meets and as a player in Honor of Kings events. She shows confident assertions on stage, while off stage she is a 9-year-old fan of Dilraba, expressing long-term affection to Dilraba until they followed each other. As a Cancer, she can sensitively understand the feelings of being a fan, sincerely respond to support, gently resolve malice, and persist in efforts through gritted teeth. The good-tempered good girl in the early days of her debut gradually became a self-controller who said, \"I am more suitable for the C position than anyone else\", always working hard in a low-key and down-to-earth manner.",
    "roleName": "Sunny",
    "headicon": "/image/data/role/Sunny.png",
    "groupIcon": "/image/data/role/Peak-idols.png"
  },
  {
    "id": 3,
    "groupName": "Peak idols",
    "mainCharacter": "Bai Xinyu",
    "chineseNickname": "Baibai",
    "age": 28.0,
    "birthdayZodiac": "01.25/Aquarius",
    "mbti": "ISTP",
    "bloodType": "Not public",
    "specialty": "Painting, video editing",
    "interests": "E-sports, gourmet food",
    "musicType": "R&B",
    "dislikedFood": "Mushrooms",
    "likedFood": "Fruits",
    "fears": "None",
    "weaknesses": "Not good at giving up",
    "introduction": null,
    "biography": "Fans call her the \"ceiling of dog-like characterization\". She can be cool or sweet, excellent in both dominant and submissive roles. She has an open personality, strong curiosity, innocence, courage, confidence, and a bit of playfulness. She cares very much about others' feelings, and in interactions, she will mock herself, be funny, and complain, giving a very real-person vibe. She has a \"mother-daughter\" relationship with fans; fans strictly require her stage performance while giving unconditional support and praise. Surrounded by such \"ferocious love\", she took step by step from the edge of the branch group with \"no memorable points\" to finally reach the top three of the main group.",
    "roleName": "Bella",
    "headicon": "/image/data/role/Bella.png",
    "groupIcon": "/image/data/role/Peak-idols.png"
  },
  {
    "id": 4,
    "groupName": "Infinity Girls",
    "mainCharacter": "Zhu Yixin",
    "chineseNickname": "Zhuzhu",
    "age": 27.0,
    "birthdayZodiac": "04.22/Taurus",
    "mbti": "ENFP",
    "bloodType": "Not public",
    "specialty": "Playing games, staying up late",
    "interests": "Shojo manga, drinking cola, wearing small skirts, collecting cute things",
    "musicType": "Pop",
    "dislikedFood": "Beef",
    "likedFood": "High-carbohydrate foods",
    "fears": "None",
    "weaknesses": "Not good at socializing",
    "introduction": "With the stage as their origin, they bloom the vitality and enthusiasm of youth, interpreting the definition of \"progress\" through every breakthrough. The shining road has no end, only the next energetic stop hand in hand.",
    "biography": "A fishing-style idol. On stage, she is a versatile idol who initially wanted to take the sweet route but turned to the fishing style after her sexy performances became popular. Her private image is quite different from that on stage; fans call her \"cold-faced mommy\" on stage and \"fan-service cutie\" off stage. She has a soft and sweet voice with a calm tone. In front of close people, she will act coquettishly and even pretend to be angry waiting for others to coax her, showing a little girl's side.",
    "roleName": "GG",
    "headicon": "/image/data/role/GG.png",
    "groupIcon": "/image/data/role/Infinity-Girls.png"
  },
  {
    "id": 5,
    "groupName": "Infinity Girls",
    "mainCharacter": "Zhang Qiongyu",
    "chineseNickname": "Qiongqiong",
    "age": 28.0,
    "birthdayZodiac": "01.21/Aquarius",
    "mbti": "INFJ",
    "bloodType": "Not public",
    "specialty": "Dancing, imitating, cold jokes",
    "interests": "Swimming, following Japanese dramas, otaku dance",
    "musicType": "Electronic pop and genres with strong rhythm",
    "dislikedFood": "Rice",
    "likedFood": "Likes spicy food",
    "fears": "None",
    "weaknesses": "Not good at dealing with hidden shooting",
    "introduction": null,
    "biography": "On stage, her dance moves are cool and stunning, able to interpret a dark and charming style, while also full of vitality, perfectly presenting youthful stages. Off stage, this radiant performer is actually a quirky and cute girl, outgoing, lively, cheerful, loves imitating, and telling cold jokes. This contrast is part of her charm. She actively responds to fans' needs and is called by fans \"Admit how cute fan-service Qiongqiong is\".",
    "roleName": "Rinako",
    "headicon": "/image/data/role/Rinako.png",
    "groupIcon": "/image/data/role/Infinity-Girls.png"
  },
  {
    "id": 6,
    "groupName": "Infinity Girls",
    "mainCharacter": "Liu Zengyan",
    "chineseNickname": "Zengguo",
    "age": 29.0,
    "birthdayZodiac": "08.31/Virgo",
    "mbti": "ISTJ",
    "bloodType": "B",
    "specialty": "Making coffee, Aikido, teasing cats, watching horror movies seriously, Japanese song covers",
    "interests": "ACG, Aikido, Vocaloid songs, LOL, electric guitar, horror game live streams, tidying rooms",
    "musicType": "Rock/Pop ballads",
    "dislikedFood": "None",
    "likedFood": "Drinking water",
    "fears": "None",
    "weaknesses": "Not good at \"catering to fans\"/not good at navigating complex interpersonal relationships",
    "introduction": null,
    "biography": "Her performance feature is covering Japanese songs. During performances, she relies on audience interaction to get into shape, saying that \"the louder the cheers, the better I perform\", praised as \"max感染力 (max appeal)\". Off stage, she is described as \"gentle and elegant like a next-door sister\", always adhering to the concept that \"hard work may not pay off, but not working hard can only maintain the status quo\". She works steadily, insisting on showing her best side and brightest smile to fans, full of positive energy.",
    "roleName": "Yancy",
    "headicon": "/image/data/role/Yancy.png",
    "groupIcon": "/image/data/role/Infinity-Girls.png"
  },
  {
    "id": 7,
    "groupName": "Infinity Girls",
    "mainCharacter": "Jiang Shuting",
    "chineseNickname": "Xiaoshu",
    "age": 23.0,
    "birthdayZodiac": "06.18/Gemini",
    "mbti": "ESFP",
    "bloodType": "O",
    "specialty": "Singing, dancing, laughing",
    "interests": "Singing, dancing, reading, anime",
    "musicType": "Pop",
    "dislikedFood": "None",
    "likedFood": "Sweet food",
    "fears": "Anxiety about stage details",
    "weaknesses": "Not good at expressing emotions",
    "introduction": null,
    "biography": "Her charm on stage lies in gentlemanly and high-emotional-intelligence interactions, thoughtfully saving the scene to avoid embarrassing group members, jokingly called by fans \"the only husband in the audience\". Off stage, she is described as \"taking the route of a beautiful and funny girl\", always finding ways to make everyone around her happy, praised by fans as \"dedicated to her career\". She joined the group at 13, grew up in a high-pressure environment, forced to mature, but is more relaxed in live streams than in performances, able to show her true personality.",
    "roleName": "Athena",
    "headicon": "/image/data/role/Athena.png",
    "groupIcon": "/image/data/role/Infinity-Girls.png"
  },
  {
    "id": 8,
    "groupName": "Infinity Girls",
    "mainCharacter": "Lin Shuqing",
    "chineseNickname": "Tiantian",
    "age": 25.0,
    "birthdayZodiac": "05.28/Gemini",
    "mbti": "INFP",
    "bloodType": "Not public",
    "specialty": "Extremely long sleep time",
    "interests": "Playing with mobile phones",
    "musicType": "Electronic pop",
    "dislikedFood": "None",
    "likedFood": "Sweet food",
    "fears": "None",
    "weaknesses": "Not good at being rigorous in public expression",
    "introduction": null,
    "biography": "She is a vibrant idol blooming with charm on stage, a sweet girl whose exquisite dance moves have transcended self-definition. Her singing is widely recognized, described as having a \"heavenly beautiful voice\" that can touch the audience's hearts. She constantly seeks breakthroughs in singing, striving to bring new surprises to fans every time. Her short hair style is called \"cute enough to make everyone dizzy\", and her cold-faced style \"breaks the cute impression with great visual impact\".",
    "roleName": "Suki",
    "headicon": "/image/data/role/Suki.png",
    "groupIcon": "/image/data/role/Infinity-Girls.png"
  },
  {
    "id": 9,
    "groupName": "Alpha V",
    "mainCharacter": "A dominator with a kind appearance but cold heart",
    "chineseNickname": null,
    "age": 25.0,
    "birthdayZodiac": "November 22/Scorpio",
    "mbti": "INTJ",
    "bloodType": "B",
    "specialty": "Controlling the overall situation",
    "interests": "Keeping up with current technological trends",
    "musicType": "Classical music",
    "dislikedFood": "Overly sweet pastries",
    "likedFood": "Single malt whisky (neat), cold brew coffee",
    "fears": "Losing emotional control",
    "weaknesses": "Not good at having aimless chats with others",
    "introduction": "The perfect symbiosis under the functional storm. Integrating control, tenderness, loyalty, wildness, and healing light, becoming an undefined ultimate ideal type with strength and trends.",
    "biography": "A self-made first-generation rich man, strict with himself and likes to control everything. His kind appearance is a protective color in interpersonal relationships; in fact, he is completely uninterested in inefficient and meaningless social interactions. Even seemingly friendly communications are often social phrases with unnoticeable purposes. His most comfortable state is when everything is in order.",
    "roleName": "Odin",
    "headicon": "/image/data/role/Suki.png",
    "groupIcon": "/image/data/role/Alpha-V.png"
  },
  {
    "id": 10,
    "groupName": "Alpha V",
    "mainCharacter": "A cold but socially anxious gentle family man",
    "chineseNickname": null,
    "age": 27.0,
    "birthdayZodiac": "July 7/Cancer",
    "mbti": "INFJ",
    "bloodType": "AB",
    "specialty": "Acting",
    "interests": "Doing housework",
    "musicType": "Classical music",
    "dislikedFood": "Food with pungent smell (such as durian, snail noodles)",
    "likedFood": "Clear stewed soups, handmade tea snacks",
    "fears": "Crowded and disorderly places (such as large music festivals, Spring Festival travel train stations)",
    "weaknesses": "Not good at impromptu speeches/unprepared speeches",
    "introduction": null,
    "biography": "He has been a top student since childhood, the \"other people's child\" in others' eyes. Because he gets nervous easily when talking to strangers, he is often mistaken for a cold person, but in fact, he is very gentle, likes to take care of people around him, and is a bit protective. He likes doing housework while listening to classical music, tidying up the house in order, and making delicious and healthy food, which gives him a sense of happiness by enhancing his control over life.",
    "roleName": "Allen",
    "headicon": "/image/data/role/Suki.png",
    "groupIcon": "/image/data/role/Alpha-V.png"
  },
  {
    "id": 11,
    "groupName": "Alpha V",
    "mainCharacter": "A free-spirited loyal dog-like trendy guy",
    "chineseNickname": null,
    "age": 23.0,
    "birthdayZodiac": "August 8/Leo",
    "mbti": "ESFP",
    "bloodType": "O",
    "specialty": "Money power",
    "interests": "Likes drinking milk tea, doesn't like coffee",
    "musicType": "Hip-hop",
    "dislikedFood": "Black coffee",
    "likedFood": "Full-sugar milk tea, barbecued meat",
    "fears": "Boring and unchanging daily life",
    "weaknesses": "Not good at things requiring long-term patience and waiting, keeping secrets",
    "introduction": null,
    "biography": "He seems to be enthusiastic, bold, and free-spirited. He can't sit still, is very active, and has many small movements. His way of showing affection is constantly approaching the person to gain attention, with a very dog-like personality, a Beagle-type handsome guy who runs away when let go.",
    "roleName": "Felix",
    "headicon": "/image/data/role/Suki.png",
    "groupIcon": "/image/data/role/Alpha-V.png"
  },
  {
    "id": 12,
    "groupName": "Alpha V",
    "mainCharacter": "Crazy wolf dog",
    "chineseNickname": null,
    "age": 25.0,
    "birthdayZodiac": "August 18/Leo",
    "mbti": "ISTP",
    "bloodType": "AB",
    "specialty": "Beast intuition",
    "interests": "Smelling scents, distinguishing people by smell",
    "musicType": "Industrial rock",
    "dislikedFood": "None",
    "likedFood": "Medium-rare steak, strong alcohol",
    "fears": "Being restrained, being treated as a docile pet",
    "weaknesses": "Not good at expressing complex emotions, remembering names and faces",
    "introduction": null,
    "biography": "His way of thinking is very different from ordinary people, so he is often mistaken for crazy by those who don't know him well. In fact, he has a self-consistent and closed-loop logic, being a principled person in his own world. Once he sets a goal, he doesn't care much about public morals, doing his best to achieve it.",
    "roleName": "Max",
    "headicon": "/image/data/role/Suki.png",
    "groupIcon": "/image/data/role/Alpha-V.png"
  },
  { 
    "id": 13,
    "groupName": "Alpha V",
    "mainCharacter": "Sunny pink-haired black-hearted younger guy",
    "chineseNickname": null,
    "age": 19.0,
    "birthdayZodiac": "May 15/Gemini",
    "mbti": "ENFP",
    "bloodType": "B",
    "specialty": "Dancing",
    "interests": "Playing games",
    "musicType": "Electronic dance music",
    "dislikedFood": "Bitter food (such as bitter melon, dark chocolate)",
    "likedFood": "Energy bars, iced cola",
    "fears": "Being completely ignored and left out",
    "weaknesses": "Not good at things requiring long-term patience and waiting",
    "introduction": null,
    "biography": "He has extremely fast reflexes, especially evident in playing games and dancing. He is an all-round game player with strong skills and many witty remarks. He has a talent for imitation, sometimes imitating the tone, small movements, and thinking patterns of people around him. Usually, he seems careless and indifferent, but in fact, he badly needs everyone's attention and care; without enough love, he will wither like a small animal. It's very easy to cheer him up—just hand him a can of iced cola.",
    "roleName": "Lucas",
    "headicon": "/image/data/role/Suki.png",
    "groupIcon": "/image/data/role/Alpha-V.png"
  },
  {
    "id": 14,
    "groupName": "La GonGon",
    "mainCharacter": "Elegant pink-haired black-hearted twin-tailed lady",
    "chineseNickname": "Snow Girl",
    "age": 18.0,
    "birthdayZodiac": "June 6/Gemini",
    "mbti": "ENTP",
    "bloodType": "O",
    "specialty": "Singing",
    "interests": "\n①Likes making malicious jokes then pretending to be innocent\n②Shopping",
    "musicType": "Jazz, two-dimensional meme songs",
    "dislikedFood": "Food made with synthetic industrial saccharin and monosodium glutamate",
    "likedFood": "Eating spicy food, remains calm even with extremely spicy food",
    "fears": "Being ignored by others",
    "weaknesses": "Not good at acting coquettishly",
    "introduction": "Welcome to La GonGon's paradise. We are willful princesses, silent knights; innocent devils, marginal observers, and lonely souls guarding bonds. In the name of bad girls, we present you the most extreme sweet trap.",
    "biography": "She grew up in a wealthy family but without family companionship, living alone with servants in a big house. Being so bored that she only had money, she loves shopping very much and is good at trends and appreciation of luxury goods. She feels a gap with peers, hoping everyone will admire and love her. To attract attention, she inadvertently makes malicious jokes then pretends to be innocent, naturally shifting the topic to herself. She is not good at expressing affection directly, especially not at acting coquettishly, and can't stand being ignored. She likes heavy classical music, jazz, and funny brainwashing internet meme songs—classical music shows taste, meme songs follow trends to create topics. Her taste in food is not ladylike at all; she can't live without spicy food, but eats elegantly, remaining calm even with extremely spicy food. She hates eating things made with synthetic industrial saccharin and monosodium glutamate, feeling attacked by cheap stuff.",
    "roleName": "Yukino",
    "headicon": "/image/data/role/Suki.png",
    "groupIcon": "/image/data/role/La-GonGon.png"
  },
  {
    "id": 15,
    "groupName": "La GonGon",
    "mainCharacter": "Air-headed beauty-obsessed cool T Chinese girl",
    "chineseNickname": "Lian",
    "age": 19.0,
    "birthdayZodiac": "June 10/Gemini",
    "mbti": "ESFP",
    "bloodType": "O",
    "specialty": "Dancing",
    "interests": "Cuddling with beautiful girls, Hanfu, sword dancing",
    "musicType": "Chinese style",
    "dislikedFood": "None",
    "likedFood": "Pastries, Cantonese cuisine",
    "fears": "Being hated",
    "weaknesses": "Not good at long speeches",
    "introduction": null,
    "biography": "She has practiced martial arts since childhood, with her precious sword accompanying her growth. She is more familiar with Chinese style and Hanfu elements, so she wears such clothes daily. She reacts slowly to others' words, especially jokes—she will laugh about them in bed at night. She more easily feels girls' tenderness and kindness, so she likes being with girls, feeling safe.",
    "roleName": "Lian",
    "headicon": "/image/data/role/Suki.png",
    "groupIcon": "/image/data/role/La-GonGon.png"
  },
  {
    "id": 16,
    "groupName": "La GonGon",
    "mainCharacter": "Tsundere white-haired Chinese style girl",
    "chineseNickname": "Moli",
    "age": 17.0,
    "birthdayZodiac": "February 14/Aquarius",
    "mbti": "ISTJ",
    "bloodType": "AB",
    "specialty": "Hanfu",
    "interests": "①Screamer in horror games, likes horror games, bad at them but can't stop playing\n②Likes Hanfu and Chinese style things",
    "musicType": "Chinese style electronic music",
    "dislikedFood": "Sticky food (such as natto, okra)",
    "likedFood": "Spicy hot pot, rock candy hawthorns",
    "fears": "Complex and ambiguous interpersonal relationships",
    "weaknesses": "Not good at tasks requiring extreme care and patience (such as puzzles, embroidery)",
    "introduction": null,
    "biography": "She has a plump figure, looking like an adult, but actually has a childish temper and mind. She is duplicitous—she won't directly express what she likes or wants, hoping others can guess her thoughts. When guessed right, she will be as happy as a child getting favorite rock candy hawthorns. She is sensitive to others' emotional changes; although she acts silly most of the time, she can always accurately guess unspoken words. She likes Chinese style things because she thinks they are beautiful.",
    "roleName": "Mori",
    "headicon": "/image/data/role/Suki.png",
    "groupIcon": "/image/data/role/La-GonGon.png"
  },
  {
    "id": 17,
    "groupName": "La GonGon",
    "mainCharacter": "Gothic mine girl Lolita",
    "chineseNickname": "Qingzi",
    "age": 16.0,
    "birthdayZodiac": "November 13/Scorpio",
    "mbti": "INFP",
    "bloodType": "A",
    "specialty": "Fortune-telling",
    "interests": "①Likes drinking Monster energy drinks\n②Doesn't eat much to maintain an unhealthy figure, not interested in food\n③Likes researching new small skirts\n④Listening to heavy metal rock\n\n",
    "musicType": "Gothic rock, shouting-style two-dimensional",
    "dislikedFood": "Carrots",
    "likedFood": "Monster energy drinks, dark chocolate",
    "fears": "Strong sunlight and crowds",
    "weaknesses": "Not good at maintaining a healthy schedule, having superficial social interactions with others",
    "introduction": null,
    "biography": "She habitually marginalizes herself, believing no one will truly love others—everyone is just putting on a show, and temporary excitement and touch will leave only残骸 (remains) like fireworks. She can't bear any pressure or expectations, but longs for someone to see and accept her messy self, existing awkwardly.",
    "roleName": "Aoko",
    "headicon": "/image/data/role/Suki.png",
    "groupIcon": "/image/data/role/La-GonGon.png"
  },
  {
    "id": 18,
    "groupName": "La GonGon",
    "mainCharacter": "Clingy punk-style older sister",
    "chineseNickname": "Qi",
    "age": 20.0,
    "birthdayZodiac": "January 8/Capricorn",
    "mbti": "ESTJ",
    "bloodType": "O",
    "specialty": "Gothic punk",
    "interests": "①Sci-fi geek, likes watching sci-fi works\n②Gothic enthusiast, has a whole shelf of accessories in the room",
    "musicType": "Punk rock",
    "dislikedFood": "Sweet and greasy cream cakes",
    "likedFood": "Spicy food, canned coffee",
    "fears": "Being abandoned or forgotten by important people",
    "weaknesses": "Not good at apologizing proactively, showing vulnerability to others",
    "introduction": null,
    "biography": "Her unhappy original family didn't teach her how to correctly express attention and love for others. During her bumpy growth, she got used to hiding her true self behind a cold exterior. She is learning to open up in team life.",
    "roleName": "Nana",
    "headicon": "/image/data/role/Suki.png",
    "groupIcon": "/image/data/role/La-GonGon.png"
  },
  {
    "id": 19,
    "groupName": "La BonBon",
    "mainCharacter": "Beautiful, strong yet tragic ascetic unattainable flower",
    "chineseNickname": "Hui",
    "age": 23.0,
    "birthdayZodiac": "February 19/Pisces",
    "mbti": "INFJ",
    "bloodType": "A",
    "specialty": "Eloquence",
    "interests": "①Extremely poor physical fitness\n②Has洁癖 (cleanliness obsession), never shares items with others",
    "musicType": "Baroque music",
    "dislikedFood": "Greasy food",
    "likedFood": "Plain porridge, clear tea",
    "fears": "Body odor and sweat smell of crowds",
    "weaknesses": "Not good at all sports, refusing others' sincere requests",
    "introduction": "Born from the ruins of civilization, we are the last beauty in despair. On this barren land, we recast the brilliance and madness of humanity for you.",
    "biography": "He has been in poor health since childhood, unable to do many outdoor sports. Fortunately, his main hobbies are thinking and planning, liking to guide and control things through limited information and words. He dislikes direct contact with living people; living things in the survival environment make him feel dangerous and out of control. He has many unmet favors and connections; when there's a problem to solve, as long as you can find him, you will definitely get a solution.",
    "roleName": "Ash",
    "headicon": "/image/data/role/Suki.png",
    "groupIcon": "/image/data/role/La-BonBon.png"
  },
  {
    "id": 20,
    "groupName": "La BonBon",
    "mainCharacter": "Rational crazy white-haired dominator",
    "chineseNickname": "Ling",
    "age": 22.0,
    "birthdayZodiac": "November 1/Scorpio",
    "mbti": "INTJ",
    "bloodType": "B",
    "specialty": "Money power",
    "interests": "①Likes acting unpredictably\n②Dresses extremely exaggeratedly, with unusual fashion taste",
    "musicType": "Noise music",
    "dislikedFood": "None",
    "likedFood": "High-alcohol spirits, overly sweet desserts",
    "fears": "Unpredictable and uncontrollable variables",
    "weaknesses": "Not good at understanding ordinary people's emotional logic",
    "introduction": null,
    "biography": "A regular member of \"Fight to the death with you rich people bot\" and \"Baffling behavior awards\"",
    "roleName": "Zero",
    "headicon": "/image/data/role/Suki.png",
    "groupIcon": "/image/data/role/La-BonBon.png"
  },
  {
    "id": 21,
    "groupName": "La BonBon",
    "mainCharacter": "Black-bellied femboy little devil",
    "chineseNickname": "Nix",
    "age": 17.0,
    "birthdayZodiac": "April 1/Aries",
    "mbti": "ENTP",
    "bloodType": "AB",
    "specialty": "Styling",
    "interests": "Genderless: enjoys seamlessly switching between extremely feminine and deliberately masculine styles",
    "musicType": "Indie pop",
    "dislikedFood": "Bitter melon",
    "likedFood": "Macarons, strawberry milk",
    "fears": "Having real intentions seen through",
    "weaknesses": "Not good at maintaining a single image for a long time, dealing with pure sincerity",
    "introduction": null,
    "biography": null,
    "roleName": "Nyx",
    "headicon": "/image/data/role/Suki.png",
    "groupIcon": "/image/data/role/La-BonBon.png"
  },
  {
    "id": 22,
    "groupName": "La BonBon",
    "mainCharacter": "Perfectionist playboy heartthrob",
    "chineseNickname": "Guang",
    "age": 21.0,
    "birthdayZodiac": "September 23/Libra",
    "mbti": "ENFJ",
    "bloodType": "O",
    "specialty": "Facial expression management",
    "interests": "Scenario rehearsal: mentally rehearses possible dialogue branches and responses for all social occasions",
    "musicType": "Jazz",
    "dislikedFood": "Garlic",
    "likedFood": "Red wine, oysters",
    "fears": "Losing composure in public, collapse of carefully maintained image",
    "weaknesses": "Having inner thoughts directly exposed",
    "introduction": null,
    "biography": null,
    "roleName": "Laito",
    "headicon": "/image/data/role/Suki.png",
    "groupIcon": "/image/data/role/La-BonBon.png"
  },
  {
    "id": 23,
    "groupName": "La BonBon",
    "mainCharacter": "Cute coquettish singing担当 (vocalist) vibrant shota",
    "chineseNickname": "You",
    "age": 14.0,
    "birthdayZodiac": "July 20/Cancer",
    "mbti": "ENFP",
    "bloodType": "B",
    "specialty": "Lead singer",
    "interests": "①Likes running, playing with everyone, afraid of loneliness\n②Many bouncing small movements",
    "musicType": "Pop music",
    "dislikedFood": "Green peppers",
    "likedFood": "Strawberry cake, milk pudding",
    "fears": "Staying alone in a dark environment",
    "weaknesses": "Not good at refusing others' requests",
    "introduction": null,
    "biography": null,
    "roleName": "Yoi",
    "headicon": "/image/data/role/Suki.png",
    "groupIcon": "/image/data/role/La-BonBon.png"
  },
  {
    "id": 24,
    "groupName": "Black Rose",
    "mainCharacter": "Human Barbie with cold and sweet appearance and tsundere inside",
    "chineseNickname": null,
    "age": 20.0,
    "birthdayZodiac": "January 30/Aquarius",
    "mbti": "INTP",
    "bloodType": "AB",
    "specialty": "Dance master",
    "interests": "①Reverse cleanliness: only the workbench is clean in the room, everything is messy, only she can find needed items\n②Collects BJD dolls, each with a complete story line",
    "musicType": "Electronic synth pop",
    "dislikedFood": "Garlic",
    "likedFood": "Macarons, strawberry milk",
    "fears": "Her \"inner story line\" being denied or mocked",
    "weaknesses": "Not good at frankly expressing concern",
    "introduction": "Sweetness and coldness, purity and control, laziness and vitality interweave here. Like a thorny black rose, releasing irresistible fatal attraction on stage.",
    "biography": null,
    "roleName": "Bibi",
    "headicon": "/image/data/role/Suki.png",
    "groupIcon": "/image/data/role/Black-Rose.png"
  },
  {
    "id": 25,
    "groupName": "Black Rose",
    "mainCharacter": "Pure appearance but strong desire to control, cold white moonlight",
    "chineseNickname": null,
    "age": 20.0,
    "birthdayZodiac": "December 24/Capricorn",
    "mbti": "ISTJ",
    "bloodType": "A",
    "specialty": "Lead singer",
    "interests": "Watching movies and guessing plots",
    "musicType": "Classical music",
    "dislikedFood": "Street food",
    "likedFood": "Blanched cabbage heart, sugar-free soy milk",
    "fears": "Unplanned and uncontrollable emergencies",
    "weaknesses": "Not good at handling messy emotional disputes",
    "introduction": null,
    "biography": null,
    "roleName": "Alice",
    "headicon": "/image/data/role/Suki.png",
    "groupIcon": "/image/data/role/Black-Rose.png"
  },
  {
    "id": 26,
    "groupName": "Black Rose",
    "mainCharacter": "Lazy queenly big wave seductive older sister",
    "chineseNickname": null,
    "age": 23.0,
    "birthdayZodiac": "November 18/Scorpio",
    "mbti": "ENTJ",
    "bloodType": "O",
    "specialty": "Powerful lead singer/guitar",
    "interests": "\n①Intracranial library: extremely fast reading speed and photographic memory;\n②Extreme single-threaded: when extremely focused, shuts down all sensory input except current task",
    "musicType": "Jazz",
    "dislikedFood": "None",
    "likedFood": "Red wine",
    "fears": "Her intelligence and ability being questioned",
    "weaknesses": "Not good at handling trivial repetitive work",
    "introduction": null,
    "biography": null,
    "roleName": "Shuen",
    "headicon": "/image/data/role/Suki.png",
    "groupIcon": "/image/data/role/Black-Rose.png"
  },
  {
    "id": 27,
    "groupName": "Black Rose",
    "mainCharacter": "Vibrant milk dog tomboy",
    "chineseNickname": null,
    "age": 21.0,
    "birthdayZodiac": "July 23/\nLeo",
    "mbti": "ESFP",
    "bloodType": "B",
    "specialty": "Rapping",
    "interests": "①Justice launcher: when seeing \"unfair\" things, actions are always faster than thoughts;\n②Way to liven up the atmosphere: telling cold jokes\n③Unconsciously moves when thinking",
    "musicType": "Hardcore rap",
    "dislikedFood": "None",
    "likedFood": "Hamburgers, energy drinks",
    "fears": "People around being wronged",
    "weaknesses": "Not good at quiet solitude",
    "introduction": null,
    "biography": null,
    "roleName": "Ruby",
    "headicon": "/image/data/role/Suki.png",
    "groupIcon": "/image/data/role/Black-Rose.png"
  },
  {
    "id": 28,
    "groupName": "Black Rose",
    "mainCharacter": "Human peach sweet girl",
    "chineseNickname": null,
    "age": 19.0,
    "birthdayZodiac": "February 20\nPisces",
    "mbti": "ENFJ",
    "bloodType": "O",
    "specialty": "ACE",
    "interests": "Instrument master, collects musical instruments from different origins and materials worldwide",
    "musicType": "City Pop",
    "dislikedFood": "All spicy food",
    "likedFood": "Peaches, soufflé pancakes",
    "fears": "Conflicts that disrupt harmonious atmosphere",
    "weaknesses": "Not good at refusing others' requests",
    "introduction": null,
    "biography": null,
    "roleName": "Miya",
    "headicon": "/image/data/role/Suki.png",
    "groupIcon": "/image/data/role/Black-Rose.png"
  },
  {
    "id": 29,
    "groupName": "@Boys",
    "mainCharacter": "Socially anxious, cold, capable dominator",
    "chineseNickname": null,
    "age": 27.0,
    "birthdayZodiac": "January 10/Capricorn",
    "mbti": "INTJ",
    "bloodType": "A",
    "specialty": "All-round ACE",
    "interests": "In his office/private area, all items must follow the \"right-angle placement\" principle",
    "musicType": "Ambient music",
    "dislikedFood": "Food with strong smell",
    "likedFood": "Black coffee, whole wheat bread",
    "fears": "Unpredictable intensive social occasions",
    "weaknesses": "Not good at remembering others' birthdays and faces",
    "introduction": "With freedom as creed, rhythm as soul, redefining trends with strength and attitude.",
    "biography": null,
    "roleName": "Silas",
    "headicon": "/image/data/role/Suki.png",
    "groupIcon": "/image/data/role/@Boys.png"
  },
  {
    "id": 30,
    "groupName": "@Boys",
    "mainCharacter": "Sunny and handsome trendy rapper who likes extreme sports",
    "chineseNickname": null,
    "age": 25.0,
    "birthdayZodiac": "December 12/Sagittarius",
    "mbti": "ESTP",
    "bloodType": "A",
    "specialty": "Singing",
    "interests": "Recording, extreme sports",
    "musicType": "Trap",
    "dislikedFood": "Bland and boring dishes",
    "likedFood": "High-protein meat (such as steak), sweet food (dare not eat much)",
    "fears": "Unchanging life",
    "weaknesses": "Not good at quiet solitude",
    "introduction": null,
    "biography": "He is a person full of vitality, with great curiosity and enthusiasm for new things in the world. He is willing to see, watch, experience and record these beautiful things, hoping to set foot on more beautiful and rare corners one day.",
    "roleName": "Jin",
    "headicon": "/image/data/role/Suki.png",
    "groupIcon": "/image/data/role/@Boys.png"
  },
  {
    "id": 31,
    "groupName": "@Boys",
    "mainCharacter": "Buddhist gentle warm guy",
    "chineseNickname": null,
    "age": 24.0,
    "birthdayZodiac": "April 20/Taurus",
    "mbti": "ISFJ",
    "bloodType": "A",
    "specialty": "Gentle lead singer",
    "interests": "Doing handiwork: mending teammates' dolls, gluing cracked table corners with special glue, repairing torn old books, with exquisite craftsmanship almost leaving no trace",
    "musicType": "Folk music",
    "dislikedFood": "Fast food",
    "likedFood": "Hand-brewed coffee, sweet osmanthus cakes",
    "fears": "Witnessing conflicts but being unable to mediate",
    "weaknesses": "Not good at fighting for his own interests",
    "introduction": null,
    "biography": null,
    "roleName": "Loris",
    "headicon": "/image/data/role/Suki.png",
    "groupIcon": "/image/data/role/@Boys.png"
  },
  {
    "id": 32,
    "groupName": "@Boys",
    "mainCharacter": "Cute虎牙 (tiger-toothed) singer-songwriter genius",
    "chineseNickname": null,
    "age": 18.0,
    "birthdayZodiac": "March 14/Pisces",
    "mbti": "ENFP",
    "bloodType": "AB",
    "specialty": "Creation",
    "interests": "Giving nicknames, collecting stickers",
    "musicType": "Neo-Soul",
    "dislikedFood": "Food with strong sour taste (such as sour lemons)",
    "likedFood": "Fruit tea and tea snacks",
    "fears": "Exhaustion of creative inspiration",
    "weaknesses": "Refusing others' kind requests",
    "introduction": null,
    "biography": "Grown up under family care and love, he knows well how to love himself and others. Actually, he is a bit different from the boys around him—he likes cute things and enjoys sharing them with others. After realizing this difference in adolescence, he had a short period of self-doubt, but now he has made peace with himself, and instead has a deeper understanding of the depth, breadth and possibilities of life.",
    "roleName": "Ivan",
    "headicon": "/image/data/role/Suki.png",
    "groupIcon": "/image/data/role/@Boys.png"
  },
  {
    "id": 33,
    "groupName": "@Boys",
    "mainCharacter": "American-style cool mixed-race guy",
    "chineseNickname": null,
    "age": 23.0,
    "birthdayZodiac": "July 4/Leo",
    "mbti": "ESTP",
    "bloodType": "O",
    "specialty": "Dance ACE",
    "interests": "①Never leaves sugar-free cola, only drinks it iced\n②Way to vent emotions: cooking",
    "musicType": "Reggae",
    "dislikedFood": "Bitter food",
    "likedFood": "Sugar-free cola, barbecued meat",
    "fears": "Being bound by rules and traditions",
    "weaknesses": "Not good at delicate handiwork",
    "introduction": null,
    "biography": null,
    "roleName": "Rey",
    "headicon": "/image/data/role/Suki.png",
    "groupIcon": "/image/data/role/@Boys.png"
  }
]